package SJMS;

public interface SideDish  extends  HotPot{
    // 可以在该子类中定义自己独有的方法

    /* ：  某国要生成手机，为了快速迭代手机功能，要求手机能实现自由升级
    基本功能为打电话 发短息
1：手机的品牌有 小豆手机  小红，芒果手机  ....
2: 手机升级的模块： 4G  5G  6G  网上  游戏  音乐  。。。。
    * */
/*
* 智能机器人的生产
*    第一代机器人技术问题 只能说话，眨眼睛
*    第二代技术成熟后 在第一带的基础上 开发了 跳舞
*     第三代技术成熟后 又开发了 唱歌
*
*  代理模式：
*     在我们不能访问目标对象 或 不知道有目前对象的情况下
*      但是我们又要访问目标对象中成员
*
*   买房  ->  客户自己去买房
*        手续比较多 ，
*     客户比较烦， 找一个中介 帮他去完成这一些工作
*     中介去代理我们客户去完成这样功能
*
*    花仔：最开始的时候他去结单 拍戏
*         越来越有名之后
*          代理人 ： 由代理人帮他谈价格，抽提成
*           花仔去表演
*
*     厂商 讲不会直接和花仔交流，转接由代理人去处理
*
*
 *
*
*     静态代理  ->在结构上和装饰者很像
*
*
*     动态代理
*
*
*
*
* */


}
